import React from "react";
import NavigationBa from "../../Shared/NavigationBa/NavigationBa";
import TrendingFlatIcon from "@mui/icons-material/TrendingFlat";
import AddIcon from "@mui/icons-material/Add";
import { useState } from "react";
import JoditEditor from "jodit-react";

const AddDocument = () => {
  const [activeButton, setActiveButton] = useState(null);
  const [chapter, setChapter] = useState("");
  const [page, setPage] = useState("");
  const [content, setContent] = useState("");

  const handleButtonClick = (buttonNumber, buttonChapter, buttonPage) => {
    setActiveButton(buttonNumber);
    setChapter(buttonChapter);
    setPage(buttonPage);
  };
  return (
    <div>
      <section>
        <NavigationBa />
      </section>
      <section className="container-fluid">
        <h3>লাইব্রেরী</h3>
      </section>
      <hr />
      <section className="container-fluid">
        <div className="">
          <div className="row">
            <div className="col-xl-2 col-lg-2 col-md-2 col-sm-4 col-2">
              {/* <>
                <h5 className="suchipotro-h5">সূচীপত্র</h5>
                <div>
                  <h6>অধ্যায় - ১</h6>
                  <div className="chapter-div">
                    <h6
                      className={
                        activeButton === 1
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(1, "অধ্যায়-১", "চ্যাপ্টার ১.১")
                      }
                    >
                      চ্যাপ্টার - ১.১
                    </h6>
                    <h6
                      className={
                        activeButton === 2
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(2, "অধ্যায়-১", "চ্যাপ্টার - ১.২")
                      }
                    >
                      চ্যাপ্টার - ১.২
                    </h6>
                    <h6
                      className={
                        activeButton === 3
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(3, "অধ্যায়-১", "চ্যাপ্টার - ১.৩")
                      }
                    >
                      চ্যাপ্টার - ১.৩
                    </h6>
                  </div>
                </div>
                <div>
                  <h6> অধ্যায় - ২</h6>
                  <div className="chapter-div">
                    <h6
                      className={
                        activeButton === 4
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(4, "অধ্যায়-২", "চ্যাপ্টার - ২.১")
                      }
                    >
                      চ্যাপ্টার - ২.১
                    </h6>
                    <h6
                      className={
                        activeButton === 5
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(5, "অধ্যায়-২", "চ্যাপ্টার - ২.২")
                      }
                    >
                      চ্যাপ্টার - ২.২
                    </h6>
                    <h6
                      className={
                        activeButton === 6
                          ? "active-button1"
                          : "inactive-button1"
                      }
                      onClick={() =>
                        handleButtonClick(6, "অধ্যায়-২", "চ্যাপ্টার - ২.৩")
                      }
                    >
                      চ্যাপ্টার - ২.৩
                    </h6>
                  </div>
                </div>
              </> */}
            </div>

            <div className="col-xl-7 col-lg-7 col-md-7 col-sm-8 col-8">
              {/* <div className="chapter-text-div">
                <div className="chapter-text-header">
                  <h5>
                    {chapter} / {page}
                  </h5>
                  <h5>পৃষ্ঠা -০১/০৩</h5>
                </div>
                <div>
                  {activeButton === 1 && (
                    <p className="chapter-texts">
                      বাংলাদেশ পরিবেশ সংরক্ষণ আইন, ১৯৯৫ (১৯৯৫ সনের ১ নম্বর আইন)
                      এর ধারা ৬ক তে প্রদত্ত ক্ষমতাবলে সরকার, মহা-পরিচালকের সহিত
                      পরামর্শক্রমে, নিম্নরূপ শর্তাধীন নির্দেশ জারি করিল, যথা:-
                      (ক) পরিবেশ অধিদপ্তর হইতে পরিবেশগত ছাড়পত্র গ্রহণ এবং
                      প্রযোজ্য ক্ষেত্রে, নবায়ন ব্যতিরেকে কোনো ব্যক্তি বা
                      প্রতিষ্ঠান পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে ব্যাটারি ভাঙ্গা
                      বা, ক্ষেত্রমত, আগুনে গলানোর কার্যক্রম পরিচালনা করিতে
                      পারিবে না; (খ) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে ব্যাটারি ভাঙ্গা বা আগুনে
                      গলানো, ইত্যাদি কার্যক্রম পরিচালনাকালে উক্ত কার্যক্রমে
                      নিয়োজিত শ্রমিক ও কর্মচারীসহ সংশ্লিষ্ট সকলের প্রয়োজনীয়
                      ব্যক্তিগত স্বাস্থ্য সুরক্ষা সরঞ্জামাদির ব্যবহার নিশ্চিত
                      করিবে; (গ) লেড-এসিড ব্যাটারি প্রস্তুতকারী ও
                      পুনঃপ্রক্রিয়াকরণের সহিত সংশ্লিষ্ট প্রতিষ্ঠানসমূহ পুরাতন বা
                      অকেজো ব্যাটারি সংগ্রহের জন্য দেশব্যাপী প্রয়োজনীয় সংখ্যক
                      ডিলার বা এজেন্ট নিয়োগ করিবে এবং ব্যাটারি সংগ্রহের জন্য
                      ফরম-১ অনুসরণপূর্বক তথ্য সংরক্ষণ করিবে; (ঘ) ব্যাটারি
                      আমদানিকারক ব্যাটারির পুনঃপ্রক্রিয়ার বিষয়টি নিশ্চিত করিবার
                      উদ্দেশ্যে পরিবেশ অধিদপ্তরের অনাপত্তি পত্র গ্রহণ করিবে এবং
                      আমদানির অনুমতি পত্র প্রাপ্তির লক্ষ্যে প্রধান আমদানি ও
                      রপ্তানি নিয়ন্ত্রকের বরাবর উক্ত অনাপত্তি পত্র দাখিল করিতে
                      হইবে; (ঙ) বিদেশ হইতে সরাসরিভাবে লেড-এসিড ব্যাটারি আমদানির
                      ক্ষেত্রে আমদানিকারক প্রতিষ্ঠানকে ব্যাটারির ব্যবহার শেষে
                      পুরাতন বা অকেজো ব্যাটারি পরিবেশগত ছাড়পত্র রহিয়াছে এমন
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের নিকট হস্তান্তর
                      করিবার জন্য আমদানির পূর্বেই চুক্তিবদ্ধ হইতে হইবে এবং উক্ত
                      প্রক্রিয়ার ব্যত্যয় হইলে, সেইক্ষেত্রে, ব্যাটারি আমদানির
                      অনুমোদন প্রদান করা হইবে না; (চ) ব্যবহৃত বা পুরাতন বা অকেজো
                      ব্যাটারি বা সমজাতীয় পণ্য নিরাপদ পরিত্যজন (safe disposal)
                      ব্যবস্থাপনার সুবিধার্থে ব্যাটারি বিক্রয়কালে প্রস্তুতকারী
                      প্রতিষ্ঠান কর্তৃক অনুমোদিত ব্যবসায়ী বা দোকানদার অথবা
                      এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের নাম, ঠিকানা, যোগাযোগের
                      নম্বর, ইত্যাদি ভোক্তা ও বড় ব্যবহারকারীগণের (টেলিকমিউনিকেশন
                      কোম্পানি, বিটিআরসি, রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে;
                      (ছ) ব্যাটারি বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার
                      প্রয়োজনীয় তথ্য সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ
                      হইলে বা মেয়াদ উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত
                      যথাযথ ব্যবস্থা গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী
                      ব্যক্তি বা প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি
                      নিরাপদ পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ
                      অধিদপ্তরের ছাড়পত্র রহিয়াছে এমন ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠান কর্তৃক অনুমোদিত
                      এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ)
                      শর্ত (জ) এর অধীন পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে
                      উহার ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা
                      ডিস্ট্রিবিউটরগণ পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত
                      হারে, হস্তান্তর মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল
                      প্রকার ব্যাটারি খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে,
                      পরিবেশ সুরক্ষার স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময়
                      ক্রেতার নিকট হইতে প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন
                      ব্যাটারি সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ
                      অধিদপ্তরের ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা
                      প্রতিষ্ঠানের নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল
                      পদ্ধতিতে যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ
                      অধিদপ্তরকে প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে
                      আমদানিকৃত সকল লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য
                      পণ্যের গায়ে দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা
                      প্রতিটি ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির
                      (বার কোড বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে
                      এবং ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ
                      ধরনের সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে;
                      (ঠ) ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div>
                  {activeButton === 2 && (
                    <p className="chapter-texts">
                      বিদেশ হইতে সরাসরিভাবে লেড-এসিড ব্যাটারি আমদানির ক্ষেত্রে
                      আমদানিকারক প্রতিষ্ঠানকে ব্যাটারির ব্যবহার শেষে পুরাতন বা
                      অকেজো ব্যাটারি পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি
                      পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের নিকট হস্তান্তর করিবার জন্য
                      আমদানির পূর্বেই চুক্তিবদ্ধ হইতে হইবে এবং উক্ত প্রক্রিয়ার
                      ব্যত্যয় হইলে, সেইক্ষেত্রে, ব্যাটারি আমদানির অনুমোদন প্রদান
                      করা হইবে না; (চ) ব্যবহৃত বা পুরাতন বা অকেজো ব্যাটারি বা
                      সমজাতীয় পণ্য নিরাপদ পরিত্যজন (safe disposal) ব্যবস্থাপনার
                      সুবিধার্থে ব্যাটারি বিক্রয়কালে প্রস্তুতকারী প্রতিষ্ঠান
                      কর্তৃক অনুমোদিত ব্যবসায়ী বা দোকানদার অথবা এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নাম, ঠিকানা, যোগাযোগের নম্বর, ইত্যাদি
                      ভোক্তা ও বড় ব্যবহারকারীগণের (টেলিকমিউনিকেশন কোম্পানি,
                      বিটিআরসি, রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে; (ছ) ব্যাটারি
                      বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার প্রয়োজনীয় তথ্য
                      সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ হইলে বা মেয়াদ
                      উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত যথাযথ ব্যবস্থা
                      গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী ব্যক্তি বা
                      প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি নিরাপদ
                      পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা
                      বা প্রতিষ্ঠান কর্তৃক অনুমোদিত এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ) শর্ত (জ) এর অধীন
                      পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে উহার
                      ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরগণ
                      পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত হারে, হস্তান্তর
                      মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল প্রকার ব্যাটারি
                      খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে, পরিবেশ সুরক্ষার
                      স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময় ক্রেতার নিকট হইতে
                      প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন ব্যাটারি
                      সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ অধিদপ্তরের
                      ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল পদ্ধতিতে
                      যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ অধিদপ্তরকে
                      প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে আমদানিকৃত সকল
                      লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য পণ্যের গায়ে
                      দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা প্রতিটি
                      ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির (বার কোড
                      বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে এবং
                      ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ ধরনের
                      সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে; (ঠ)
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div>
                  {activeButton === 3 && (
                    <p className="chapter-texts">
                      লেড-এসিড ব্যাটারি প্রস্তুতকারী ও পুনঃপ্রক্রিয়াকরণের সহিত
                      সংশ্লিষ্ট প্রতিষ্ঠানসমূহ পুরাতন বা অকেজো ব্যাটারি সংগ্রহের
                      জন্য দেশব্যাপী প্রয়োজনীয় সংখ্যক ডিলার বা এজেন্ট নিয়োগ
                      করিবে এবং ব্যাটারি সংগ্রহের জন্য ফরম-১ অনুসরণপূর্বক তথ্য
                      সংরক্ষণ করিবে; (ঘ) ব্যাটারি আমদানিকারক ব্যাটারির
                      পুনঃপ্রক্রিয়ার বিষয়টি নিশ্চিত করিবার উদ্দেশ্যে পরিবেশ
                      অধিদপ্তরের অনাপত্তি পত্র গ্রহণ করিবে এবং আমদানির অনুমতি
                      পত্র প্রাপ্তির লক্ষ্যে প্রধান আমদানি ও রপ্তানি নিয়ন্ত্রকের
                      বরাবর উক্ত অনাপত্তি পত্র দাখিল করিতে হইবে; (ঙ) বিদেশ হইতে
                      সরাসরিভাবে লেড-এসিড ব্যাটারি আমদানির ক্ষেত্রে আমদানিকারক
                      প্রতিষ্ঠানকে ব্যাটারির ব্যবহার শেষে পুরাতন বা অকেজো
                      ব্যাটারি পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি
                      পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের নিকট হস্তান্তর করিবার জন্য
                      আমদানির পূর্বেই চুক্তিবদ্ধ হইতে হইবে এবং উক্ত প্রক্রিয়ার
                      ব্যত্যয় হইলে, সেইক্ষেত্রে, ব্যাটারি আমদানির অনুমোদন প্রদান
                      করা হইবে না; (চ) ব্যবহৃত বা পুরাতন বা অকেজো ব্যাটারি বা
                      সমজাতীয় পণ্য নিরাপদ পরিত্যজন (safe disposal) ব্যবস্থাপনার
                      সুবিধার্থে ব্যাটারি বিক্রয়কালে প্রস্তুতকারী প্রতিষ্ঠান
                      কর্তৃক অনুমোদিত ব্যবসায়ী বা দোকানদার অথবা এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নাম, ঠিকানা, যোগাযোগের নম্বর, ইত্যাদি
                      ভোক্তা ও বড় ব্যবহারকারীগণের (টেলিকমিউনিকেশন কোম্পানি,
                      বিটিআরসি, রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে; (ছ) ব্যাটারি
                      বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার প্রয়োজনীয় তথ্য
                      সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ হইলে বা মেয়াদ
                      উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত যথাযথ ব্যবস্থা
                      গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী ব্যক্তি বা
                      প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি নিরাপদ
                      পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা
                      বা প্রতিষ্ঠান কর্তৃক অনুমোদিত এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ) শর্ত (জ) এর অধীন
                      পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে উহার
                      ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরগণ
                      পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত হারে, হস্তান্তর
                      মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল প্রকার ব্যাটারি
                      খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে, পরিবেশ সুরক্ষার
                      স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময় ক্রেতার নিকট হইতে
                      প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন ব্যাটারি
                      সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ অধিদপ্তরের
                      ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল পদ্ধতিতে
                      যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ অধিদপ্তরকে
                      প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে আমদানিকৃত সকল
                      লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য পণ্যের গায়ে
                      দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা প্রতিটি
                      ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির (বার কোড
                      বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে এবং
                      ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ ধরনের
                      সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে; (ঠ)
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div>
                  {activeButton === 4 && (
                    <p className="chapter-texts">
                      কোনো ব্যক্তি বা প্রতিষ্ঠান পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে
                      ব্যাটারি ভাঙ্গা বা আগুনে গলানো, ইত্যাদি কার্যক্রম
                      পরিচালনাকালে উক্ত কার্যক্রমে নিয়োজিত শ্রমিক ও কর্মচারীসহ
                      সংশ্লিষ্ট সকলের প্রয়োজনীয় ব্যক্তিগত স্বাস্থ্য সুরক্ষা
                      সরঞ্জামাদির ব্যবহার নিশ্চিত করিবে; (গ) লেড-এসিড ব্যাটারি
                      প্রস্তুতকারী ও পুনঃপ্রক্রিয়াকরণের সহিত সংশ্লিষ্ট
                      প্রতিষ্ঠানসমূহ পুরাতন বা অকেজো ব্যাটারি সংগ্রহের জন্য
                      দেশব্যাপী প্রয়োজনীয় সংখ্যক ডিলার বা এজেন্ট নিয়োগ করিবে এবং
                      ব্যাটারি সংগ্রহের জন্য ফরম-১ অনুসরণপূর্বক তথ্য সংরক্ষণ
                      করিবে; (ঘ) ব্যাটারি আমদানিকারক ব্যাটারির পুনঃপ্রক্রিয়ার
                      বিষয়টি নিশ্চিত করিবার উদ্দেশ্যে পরিবেশ অধিদপ্তরের অনাপত্তি
                      পত্র গ্রহণ করিবে এবং আমদানির অনুমতি পত্র প্রাপ্তির লক্ষ্যে
                      প্রধান আমদানি ও রপ্তানি নিয়ন্ত্রকের বরাবর উক্ত অনাপত্তি
                      পত্র দাখিল করিতে হইবে; (ঙ) বিদেশ হইতে সরাসরিভাবে লেড-এসিড
                      ব্যাটারি আমদানির ক্ষেত্রে আমদানিকারক প্রতিষ্ঠানকে
                      ব্যাটারির ব্যবহার শেষে পুরাতন বা অকেজো ব্যাটারি পরিবেশগত
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের
                      নিকট হস্তান্তর করিবার জন্য আমদানির পূর্বেই চুক্তিবদ্ধ হইতে
                      হইবে এবং উক্ত প্রক্রিয়ার ব্যত্যয় হইলে, সেইক্ষেত্রে,
                      ব্যাটারি আমদানির অনুমোদন প্রদান করা হইবে না; (চ) ব্যবহৃত
                      বা পুরাতন বা অকেজো ব্যাটারি বা সমজাতীয় পণ্য নিরাপদ
                      পরিত্যজন (safe disposal) ব্যবস্থাপনার সুবিধার্থে ব্যাটারি
                      বিক্রয়কালে প্রস্তুতকারী প্রতিষ্ঠান কর্তৃক অনুমোদিত
                      ব্যবসায়ী বা দোকানদার অথবা এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের
                      নাম, ঠিকানা, যোগাযোগের নম্বর, ইত্যাদি ভোক্তা ও বড়
                      ব্যবহারকারীগণের (টেলিকমিউনিকেশন কোম্পানি, বিটিআরসি,
                      রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে; (ছ) ব্যাটারি
                      বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার প্রয়োজনীয় তথ্য
                      সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ হইলে বা মেয়াদ
                      উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত যথাযথ ব্যবস্থা
                      গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী ব্যক্তি বা
                      প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি নিরাপদ
                      পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা
                      বা প্রতিষ্ঠান কর্তৃক অনুমোদিত এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ) শর্ত (জ) এর অধীন
                      পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে উহার
                      ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরগণ
                      পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত হারে, হস্তান্তর
                      মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল প্রকার ব্যাটারি
                      খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে, পরিবেশ সুরক্ষার
                      স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময় ক্রেতার নিকট হইতে
                      প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন ব্যাটারি
                      সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ অধিদপ্তরের
                      ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল পদ্ধতিতে
                      যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ অধিদপ্তরকে
                      প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে আমদানিকৃত সকল
                      লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য পণ্যের গায়ে
                      দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা প্রতিটি
                      ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির (বার কোড
                      বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে এবং
                      ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ ধরনের
                      সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে; (ঠ)
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div>
                  {activeButton === 5 && (
                    <p className="chapter-texts">
                      বাংলাদেশ পরিবেশ সংরক্ষণ আইন, ১৯৯৫ (১৯৯৫ সনের ১ নম্বর আইন)
                      এর ধারা ৬ক তে প্রদত্ত ক্ষমতাবলে সরকার, মহা-পরিচালকের সহিত
                      পরামর্শক্রমে, নিম্নরূপ শর্তাধীন নির্দেশ জারি করিল, যথা:-
                      (ক) পরিবেশ অধিদপ্তর হইতে পরিবেশগত ছাড়পত্র গ্রহণ এবং
                      প্রযোজ্য ক্ষেত্রে, নবায়ন ব্যতিরেকে কোনো ব্যক্তি বা
                      প্রতিষ্ঠান পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে ব্যাটারি ভাঙ্গা
                      বা, ক্ষেত্রমত, আগুনে গলানোর কার্যক্রম পরিচালনা করিতে
                      পারিবে না; (খ) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে ব্যাটারি ভাঙ্গা বা আগুনে
                      গলানো, ইত্যাদি কার্যক্রম পরিচালনাকালে উক্ত কার্যক্রমে
                      নিয়োজিত শ্রমিক ও কর্মচারীসহ সংশ্লিষ্ট সকলের প্রয়োজনীয়
                      ব্যক্তিগত স্বাস্থ্য সুরক্ষা সরঞ্জামাদির ব্যবহার নিশ্চিত
                      করিবে; (গ) লেড-এসিড ব্যাটারি প্রস্তুতকারী ও
                      পুনঃপ্রক্রিয়াকরণের সহিত সংশ্লিষ্ট প্রতিষ্ঠানসমূহ পুরাতন বা
                      অকেজো ব্যাটারি সংগ্রহের জন্য দেশব্যাপী প্রয়োজনীয় সংখ্যক
                      ডিলার বা এজেন্ট নিয়োগ করিবে এবং ব্যাটারি সংগ্রহের জন্য
                      ফরম-১ অনুসরণপূর্বক তথ্য সংরক্ষণ করিবে; (ঘ) ব্যাটারি
                      আমদানিকারক ব্যাটারির পুনঃপ্রক্রিয়ার বিষয়টি নিশ্চিত করিবার
                      উদ্দেশ্যে পরিবেশ অধিদপ্তরের অনাপত্তি পত্র গ্রহণ করিবে এবং
                      আমদানির অনুমতি পত্র প্রাপ্তির লক্ষ্যে প্রধান আমদানি ও
                      রপ্তানি নিয়ন্ত্রকের বরাবর উক্ত অনাপত্তি পত্র দাখিল করিতে
                      হইবে; (ঙ) বিদেশ হইতে সরাসরিভাবে লেড-এসিড ব্যাটারি আমদানির
                      ক্ষেত্রে আমদানিকারক প্রতিষ্ঠানকে ব্যাটারির ব্যবহার শেষে
                      পুরাতন বা অকেজো ব্যাটারি পরিবেশগত ছাড়পত্র রহিয়াছে এমন
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের নিকট হস্তান্তর
                      করিবার জন্য আমদানির পূর্বেই চুক্তিবদ্ধ হইতে হইবে এবং উক্ত
                      প্রক্রিয়ার ব্যত্যয় হইলে, সেইক্ষেত্রে, ব্যাটারি আমদানির
                      অনুমোদন প্রদান করা হইবে না; (চ) ব্যবহৃত বা পুরাতন বা অকেজো
                      ব্যাটারি বা সমজাতীয় পণ্য নিরাপদ পরিত্যজন (safe disposal)
                      ব্যবস্থাপনার সুবিধার্থে ব্যাটারি বিক্রয়কালে প্রস্তুতকারী
                      প্রতিষ্ঠান কর্তৃক অনুমোদিত ব্যবসায়ী বা দোকানদার অথবা
                      এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের নাম, ঠিকানা, যোগাযোগের
                      নম্বর, ইত্যাদি ভোক্তা ও বড় ব্যবহারকারীগণের (টেলিকমিউনিকেশন
                      কোম্পানি, বিটিআরসি, রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে;
                      (ছ) ব্যাটারি বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার
                      প্রয়োজনীয় তথ্য সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ
                      হইলে বা মেয়াদ উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত
                      যথাযথ ব্যবস্থা গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী
                      ব্যক্তি বা প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি
                      নিরাপদ পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ
                      অধিদপ্তরের ছাড়পত্র রহিয়াছে এমন ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠান কর্তৃক অনুমোদিত
                      এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ)
                      শর্ত (জ) এর অধীন পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে
                      উহার ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা
                      ডিস্ট্রিবিউটরগণ পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত
                      হারে, হস্তান্তর মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল
                      প্রকার ব্যাটারি খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে,
                      পরিবেশ সুরক্ষার স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময়
                      ক্রেতার নিকট হইতে প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন
                      ব্যাটারি সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ
                      অধিদপ্তরের ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা
                      প্রতিষ্ঠানের নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল
                      পদ্ধতিতে যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ
                      অধিদপ্তরকে প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে
                      আমদানিকৃত সকল লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য
                      পণ্যের গায়ে দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা
                      প্রতিটি ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির
                      (বার কোড বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে
                      এবং ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ
                      ধরনের সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে;
                      (ঠ) ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div>
                  {activeButton === 6 && (
                    <p className="chapter-texts">
                      পরিবেশ অধিদপ্তর হইতে পরিবেশগত ছাড়পত্র গ্রহণ এবং প্রযোজ্য
                      ক্ষেত্রে, নবায়ন ব্যতিরেকে কোনো ব্যক্তি বা প্রতিষ্ঠান
                      পুনঃপ্রক্রিয়াকরণের উদ্দেশ্যে ব্যাটারি ভাঙ্গা বা,
                      ক্ষেত্রমত, আগুনে গলানোর কার্যক্রম পরিচালনা করিতে পারিবে
                      না; (খ) কোনো ব্যক্তি বা প্রতিষ্ঠান পুনঃপ্রক্রিয়াকরণের
                      উদ্দেশ্যে ব্যাটারি ভাঙ্গা বা আগুনে গলানো, ইত্যাদি
                      কার্যক্রম পরিচালনাকালে উক্ত কার্যক্রমে নিয়োজিত শ্রমিক ও
                      কর্মচারীসহ সংশ্লিষ্ট সকলের প্রয়োজনীয় ব্যক্তিগত স্বাস্থ্য
                      সুরক্ষা সরঞ্জামাদির ব্যবহার নিশ্চিত করিবে; (গ) লেড-এসিড
                      ব্যাটারি প্রস্তুতকারী ও পুনঃপ্রক্রিয়াকরণের সহিত সংশ্লিষ্ট
                      প্রতিষ্ঠানসমূহ পুরাতন বা অকেজো ব্যাটারি সংগ্রহের জন্য
                      দেশব্যাপী প্রয়োজনীয় সংখ্যক ডিলার বা এজেন্ট নিয়োগ করিবে এবং
                      ব্যাটারি সংগ্রহের জন্য ফরম-১ অনুসরণপূর্বক তথ্য সংরক্ষণ
                      করিবে; (ঘ) ব্যাটারি আমদানিকারক ব্যাটারির পুনঃপ্রক্রিয়ার
                      বিষয়টি নিশ্চিত করিবার উদ্দেশ্যে পরিবেশ অধিদপ্তরের অনাপত্তি
                      পত্র গ্রহণ করিবে এবং আমদানির অনুমতি পত্র প্রাপ্তির লক্ষ্যে
                      প্রধান আমদানি ও রপ্তানি নিয়ন্ত্রকের বরাবর উক্ত অনাপত্তি
                      পত্র দাখিল করিতে হইবে; (ঙ) বিদেশ হইতে সরাসরিভাবে লেড-এসিড
                      ব্যাটারি আমদানির ক্ষেত্রে আমদানিকারক প্রতিষ্ঠানকে
                      ব্যাটারির ব্যবহার শেষে পুরাতন বা অকেজো ব্যাটারি পরিবেশগত
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকরণ প্রতিষ্ঠানের
                      নিকট হস্তান্তর করিবার জন্য আমদানির পূর্বেই চুক্তিবদ্ধ হইতে
                      হইবে এবং উক্ত প্রক্রিয়ার ব্যত্যয় হইলে, সেইক্ষেত্রে,
                      ব্যাটারি আমদানির অনুমোদন প্রদান করা হইবে না; (চ) ব্যবহৃত
                      বা পুরাতন বা অকেজো ব্যাটারি বা সমজাতীয় পণ্য নিরাপদ
                      পরিত্যজন (safe disposal) ব্যবস্থাপনার সুবিধার্থে ব্যাটারি
                      বিক্রয়কালে প্রস্তুতকারী প্রতিষ্ঠান কর্তৃক অনুমোদিত
                      ব্যবসায়ী বা দোকানদার অথবা এজেন্ট, ডিলার বা ডিস্ট্রিবিউটরের
                      নাম, ঠিকানা, যোগাযোগের নম্বর, ইত্যাদি ভোক্তা ও বড়
                      ব্যবহারকারীগণের (টেলিকমিউনিকেশন কোম্পানি, বিটিআরসি,
                      রেলওয়ে, ইত্যাদি) নিকট সরবরাহ করিবে; (ছ) ব্যাটারি
                      বিক্রয়কারী বা সরবরাহকারী প্রতিষ্ঠান ক্রেতার প্রয়োজনীয় তথ্য
                      সংরক্ষণ করিবে এবং পণ্যের কার্যকারিতা শেষ হইলে বা মেয়াদ
                      উত্তীর্ণ হইলে, উহা সংগ্রহ করিবার নিমিত্ত যথাযথ ব্যবস্থা
                      গ্রহণ করিবে; (জ) ব্যাটারি ব্যবহারকারী ব্যক্তি বা
                      প্রতিষ্ঠান সকল পুরাতন বা অকার্যকর ব্যাটারি নিরাপদ
                      পরিত্যজনের (safe disposal) উদ্দেশ্যে পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা
                      বা প্রতিষ্ঠান কর্তৃক অনুমোদিত এজেন্ট, ডিলার বা
                      ডিস্ট্রিবিউটরের নিকট হস্তান্তর করিবে; (ঝ) শর্ত (জ) এর অধীন
                      পুরাতন বা অকার্যকর ব্যাটারি হস্তান্তরকালে উহার
                      ব্যবহারকারীগণ খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরগণ
                      পারস্পরিক সম্মতির ভিত্তিতে, নির্ধারিত হারে, হস্তান্তর
                      মূল্য প্রদান ও গ্রহণ করিতে পারিবে; (ঞ) সকল প্রকার ব্যাটারি
                      খুচরা বিক্রেতা, ডিলার বা ডিস্ট্রিবিউটরকে, পরিবেশ সুরক্ষার
                      স্বার্থে নূতন ব্যাটারি বিক্রয়ের সময় ক্রেতার নিকট হইতে
                      প্রতিটি নতুন ব্যাটারির বিপরীতে পুরাতন ব্যাটারি
                      সংগ্রহপূর্বক, ৩ (তিন) মাসের মধ্যে, উহা পরিবেশ অধিদপ্তরের
                      ছাড়পত্রপ্রাপ্ত পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      নিকট প্রেরণ করিতে হইবে এবং উক্ত তথ্য ডিজিটাল পদ্ধতিতে
                      যথাযথভাবে লিপিবদ্ধ করিয়া সংরক্ষণপূর্বক পরিবেশ অধিদপ্তরকে
                      প্রেরণ করিবে; (ট) দেশে উৎপাদিত বা বিদেশ হইতে আমদানিকৃত সকল
                      লেড-এসিড ব্যাটারির গতিবিধি পর্যবেক্ষণের জন্য পণ্যের গায়ে
                      দেশের কোড, ক্রমিক নম্বরসহ কোম্পানি কোড বা প্রতিটি
                      ব্যাটারির ব্যক্তিগত পরিচয় সংবলিত ডিজিটাল পদ্ধতির (বার কোড
                      বা কিউআর কোড, ইত্যাদি) ব্যবহার চালু করিতে হইবে এবং
                      ব্যাটারিতে ব্যবহৃত সিসা স্বাস্থ্যের জন্য ক্ষতিকর এ ধরনের
                      সতর্কীকরণ বার্তা ব্যাটারির গায়ে উল্লেখ করিতে হইবে; (ঠ)
                      ব্যাটারি পুনঃপ্রক্রিয়াকরণে নিয়োজিত প্রতিষ্ঠানকে পরিবেশ
                      অধিদপ্তর হইতে ছাড়পত্র গ্রহণ ও নবায়নের পূর্বে এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) এর সদস্য হিসাবে নিবন্ধিত হইতে হইবে;
                      (ড) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ কারখানা বা প্রতিষ্ঠানের
                      (recycling plant) পরিবেশগত ছাড়পত্র প্রাপ্তির আবেদনের সহিত
                      “পুনঃপ্রক্রিয়াকৃত সিসা কেবলমাত্র পরিবেশ অধিদপ্তরের
                      পরিবেশগত ছাড়পত্র রহিয়াছে এমন ব্যাটারি প্রস্তুতকারী
                      প্রতিষ্ঠানসমূহকে সরবরাহ করা হইবে” মর্মে অঙ্গীকারনামা
                      প্রদান করিতে হইবে; (ঢ) পরিবেশগত ছাড়পত্রপ্রাপ্ত ব্যাটারি
                      পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান প্রতি ৬ (ছয়) মাস অন্তর বা
                      বৎসরে ২ (দুই) বার পুনঃপ্রক্রিয়াকৃত সিসার পরিমাণ এবং
                      বিক্রয়ের তথ্য ফরম-২ অনুযায়ী পরিবেশ অধিদপ্তরকে অবহিত করিবে;
                      (ণ) ব্যাটারি প্রস্তুতকারী প্রতিষ্ঠানসমূহ পরিবেশ অধিদপ্তরের
                      ছাড়পত্র রহিয়াছে এমন ব্যাটারি পুনঃপ্রক্রিয়াকারী প্রতিষ্ঠান
                      ব্যতীত অন্য কোনো অননুমোদিত প্রতিষ্ঠান হইতে সিসা সংগ্রহ বা
                      ক্রয় করিতে পারিবে না; (ত) কোনো ব্যক্তি বা প্রতিষ্ঠান
                      (ভোক্তা বা ব্যবহারকারী, সংগ্রহকারী, আমদানিকারক,
                      পুনঃপ্রক্রিয়াকারী, রপ্তানিকারী, উৎপাদনকারী ও অন্যান্য
                      যেসকল ব্যক্তি বা প্রতিষ্ঠান ব্যাটারির সহিত সম্পৃক্ত)
                      পুরাতন বা অকার্যকর ব্যাটারি বা উহার অংশবিশেষ, কোনো
                      অবস্থাতেই উন্মুক্ত স্থান, মাটি, পানি, জলাশয়, আবর্জনা ফেলার
                      স্থান বা অন্য কোনো স্থানে সংরক্ষণ, পোড়ানো এবং নিক্ষেপ
                      করিবে না; (থ) ব্যাটারি পুনঃপ্রক্রিয়াজাতকরণ বিষয়ে প্রিন্ট ও
                      ইলেকট্রনিক মিডিয়া বা অন্য কোনো মিডিয়ার মাধ্যমে জনসাধারণকে
                      সচেতন করিতে হইবে এবং পরিবেশ অধিদপ্তর ও এ্যাকুমুলেটর
                      ব্যাটারি ম্যানুফেকচারার্স এন্ড এক্সপোর্টার্স এসোসিয়েশন অব
                      বাংলাদেশ (এবিএমইএবি) যৌথভাবে প্রচারণার কার্যক্রম পরিচালনা
                      করিবে; ‌এবং (দ) এই প্রজ্ঞাপন প্রত্যেক ব্যাটারি
                      পুনঃপ্রক্রিয়াজাতকারী, বৃহৎ ভোক্তা বা প্রতিষ্ঠান,
                      আমদানিকারক, এজেন্ট, ডিলার বা ডিস্ট্রিবিউটগণ স্ব-স্ব
                      কর্মস্থলের নির্দিষ্ট স্থানে প্রদর্শন করিবে।
                    </p>
                  )}
                </div>
                <div className="TrendingFlatIcon-div">
                  <TrendingFlatIcon className="TrendingFlatIcon" />
                </div>
              </div> */}
              <div className="chapter-text-div">
                <div className="chapter-text-header">{/* header Text */}</div>
                <JoditEditor
                  value={content}
                  onChange={setContent}
                  height={400}
                  spellcheck={false}
                  language="en"
                />
              </div>
            </div>

            <div className="col-xl-3 col-lg-3 col-md-3 col-sm-12 col-12">
              <h5 className="mt-3">তথ্য পরিবর্তন করুন </h5>
              <div className="book-add-input">
                <select
                  className="form-select draft-form-control"
                  aria-label="Default select example"
                >
                  <option selected>পরিবেশ আইন সংকলন ১০১-২০০</option>
                  <option value="1">জাতীয় পরিবেশ নীতি ২০১৮</option>
                  <option value="2">পরিবেশ আইন সংকলন ২০০-৩৩৬</option>
                  <option value="3">পরিবেশ আদালত আইন, ২০১০</option>
                </select>
                <AddIcon className="book-add-icon" />
              </div>
              <div className="book-add-input">
                <select
                  className="form-select draft-form-control"
                  aria-label="Default select example"
                >
                  <option selected>অধ্যায় - ১</option>
                  <option value="1">অধ্যায় - ২</option>
                  <option value="2">অধ্যায় - ৩</option>
                  <option value="3">অধ্যায় - ৪ </option>
                </select>
                <AddIcon className="book-add-icon" />
              </div>
              <div className="book-add-input">
                <select
                  className="form-select draft-form-control"
                  aria-label="Default select example"
                >
                  <option selected>অনুচ্ছেদ - ১.১</option>
                  <option value="1">অনুচ্ছেদ - ১.২</option>
                  <option value="2">অনুচ্ছেদ - ১.৩</option>
                  <option value="3">অনুচ্ছেদ - ১.৪</option>
                </select>
                <AddIcon className="book-add-icon" />
              </div>
              <div className="book-add-input">
                <select
                  className="form-select draft-form-control"
                  aria-label="Default select example"
                >
                  <option selected>আইন বিষয়ক</option>
                  <option value="1">আইন প্রণালী</option>
                  <option value="2">আইনের বিশ্বেসত্ব</option>
                  <option value="3">আইন অধিকার</option>
                </select>
                <AddIcon className="book-add-icon" />
              </div>
              <div className=" book-input-button-div">
                <button type="submit" className="book-input-button">
                  আপডেট করুন
                </button>
              </div>
            </div>
          </div>
        </div>
      </section>
    </div>
  );
};

export default AddDocument;
